{
  "projects": [
    {
      "name": "Daemon",
      "accent": "#34c759",
      "description": "is an AI-native firmware-to-agent bridge that compiles device capabilities into structured, learnable command interfaces.",
      "longTitle": "Daemon: compiling embedded firmware into an agent-controllable substrate for embodied intelligence.",
      "details": "Daemon transforms low-level firmware into a structured semantic interface that autonomous agents can safely reason over and execute. A build step generates a machine-readable command schema and a C-level dispatcher that maps tokens to hardware functions, enabling adaptive device control as sensors and actuators evolve. The core goal is embodiment: treating physical systems as extensible, composable APIs that agents can learn, audit, and orchestrate.",
      "url": "https://github.com/Sachin-dot-py/Daemon",
      "stack": [
        { "src": "assets/tech/c.png", "label": "C" },
        { "src": "assets/tech/rust.png", "label": "Rust" },
        { "src": "assets/tech/python.png", "label": "Python" }
      ],
      "focus": [
        "Embodied agents",
        "Compiler-style interface generation",
        "Safe hardware actuation"
      ]
    },
    {
      "name": "Siri++",
      "accent": "#bf5af2",
      "description": "is a multimodal agent orchestration system focused on persistent memory, tool execution, and workflow completion.",
      "longTitle": "Siri++: structured multimodal agent orchestration with persistent context and cross-tool execution.",
      "details": "Siri++ explores the gap between single-turn LLM responses and sustained autonomous workflows. It integrates multimodal inputs (text, voice, images), structured memory, and tool invocation under explicit orchestration loops. Rather than wrapping APIs, the system models long-horizon task decomposition, state persistence, and recovery from execution failure—treating agent behavior as a systems problem, not a prompt problem.",
      "url": "https://github.com/VedPanse/SiriPlusPlus",
      "stack": [
        { "src": "assets/tech/swift.png", "label": "Swift" },
        { "src": "assets/tech/python.png", "label": "Python" }
      ],
      "focus": [
        "Agent control loops",
        "Persistent memory systems",
        "Long-horizon task execution"
      ]
    },
    {
      "name": "Ion",
      "accent": "#0a84ff",
      "description": "is a real-time hardware blueprinting system that infers connectivity graphs and renders live 3D wiring models.",
      "longTitle": "Ion: inference-driven hardware graph construction and real-time 3D visualization under correctness constraints.",
      "details": "Ion detects microcontrollers and peripherals, constructs structured connection graphs, and renders live 3D wiring blueprints as hardware is assembled. It enforces safety constraints and generates starter firmware based on inferred topology. The system reframes hardware assembly as a graph inference and validation problem, bridging physical systems with machine reasoning and IDE-grade feedback loops.",
      "url": "https://youtu.be/sX_8WW7cI7I",
      "stack": [
        { "src": "assets/tech/rust.png", "label": "Rust" },
        { "src": "assets/tech/tauri.svg", "label": "Tauri" },
        { "src": "assets/tech/python.png", "label": "Python" }
      ],
      "focus": [
        "Graph inference",
        "Real-time 3D systems",
        "Hardware-software co-design"
      ]
    },
    {
      "name": "Shardwise",
      "accent": "#ff375f",
      "description": "is a deterministic sharding and execution engine for scalable, coordinated agent workloads.",
      "longTitle": "Shardwise: deterministic workload decomposition and coordinated execution for large-scale agent systems.",
      "details": "Shardwise partitions complex workloads into explicit, deterministic shards with defined coordination and retry semantics. It exposes shard-level observability, latency tracking, and failure recovery mechanisms to ensure predictable behavior under load. Designed to support agentic systems that require controlled parallelism rather than opportunistic concurrency.",
      "url": "",
      "stack": [
        { "src": "assets/tech/go.png", "label": "Go" },
        { "src": "assets/tech/rust.png", "label": "Rust" }
      ],
      "focus": [
        "Deterministic concurrency",
        "Distributed execution",
        "Predictable scaling"
      ]
    }
  ]
}