{
  "projects": [
    {
      "name": "Falcon Eye",
      "accent": "#ff9f0a",
      "description": "is a synthetic vision and terrain-aware flight assistance system delivering real-time 3D perception for low-visibility aviation.",
      "longTitle": "Falcon Eye delivers real-time synthetic vision for safe low-visibility flight.",
      "details": "Falcon Eye reconstructs surrounding terrain and obstacles into a real-time 3D flight corridor, helping pilots maintain spatial awareness when visual cues are lost. The system is optimized for low-latency rendering on constrained hardware and prioritizes robustness, clarity, and pilot-first situational awareness.",
      "url": "",
      "stack": [
        { "src": "assets/cpp.png", "label": "C++" },
        { "src": "assets/c.png", "label": "C" },
        { "src": "assets/python.png", "label": "Python" }
      ]
    },
    {
      "name": "Ion",
      "accent": "#0a84ff",
      "description": "is an AI-powered 3D hardware blueprinting system that auto-detects components, renders wiring in real time, and generates safe starter code.",
      "longTitle": "Ion converts physical hardware into a live 3D blueprint with wiring and code generation.",
      "details": "Ion detects microcontrollers and peripherals, infers connectivity, and renders a live wiring blueprint as hardware is assembled. It produces structured connection graphs, flags unsafe wiring patterns, and generates starter firmware—bridging the gap between bench prototypes and production-ready schematics.",
      "url": "https://youtu.be/sX_8WW7cI7I",
      "stack": [
        { "src": "assets/rust.png", "label": "Rust" },
        { "src": "assets/tauri.svg", "label": "Tauri" },
        { "src": "assets/python.png", "label": "Python" }
      ]
    },
    {
      "name": "Siri++",
      "accent": "#bf5af2",
      "description": "is a multimodal, agentic personal assistant that orchestrates workflows across apps using voice, images, and system context.",
      "longTitle": "Siri++ executes real workflows using multimodal understanding and persistent context.",
      "details": "Siri++ combines multimodal input (text, voice, images) with structured memory and tool execution to complete multi-step tasks across apps. It maintains continuity across sessions and focuses on end-to-end workflow completion rather than single-turn commands.",
      "url": "https://github.com/VedPanse/SiriPlusPlus",
      "stack": [
        { "src": "assets/swift.png", "label": "Swift" },
        { "src": "assets/python.png", "label": "Python" },
        { "src": "assets/langchain.png", "label": "LangChain" }
      ]
    },
    {
      "name": "Pulse",
      "accent": "#34c759",
      "description": "is a disaster-resilient mesh-network and survivor-localization system designed to operate entirely offline.",
      "longTitle": "Pulse enables offline mesh communication and survivor localization during disasters.",
      "details": "Pulse forms an ad-hoc, offline-first mesh network that supports SOS messaging and location sharing when infrastructure fails. It prioritizes low-power operation, hop-by-hop reliability, and graceful degradation under extreme conditions.",
      "url": "https://github.com/VedPanse/Pulse",
      "stack": [
        { "src": "assets/kotlin.png", "label": "Kotlin" },
        { "src": "assets/swift.png", "label": "Swift" },
        { "src": "assets/android-tech.png", "label": "Android" }
      ]
    },
    {
      "name": "Shardwise",
      "accent": "#ff375f",
      "description": "is a distributed sharding and execution layer that decomposes large workloads into coordinated execution units.",
      "longTitle": "Shardwise breaks large workloads into coordinated, scalable execution shards.",
      "details": "Shardwise partitions compute into deterministic shards with explicit coordination and retry semantics. It is designed for predictable throughput under load, with visibility into shard-level latency and failure behavior.",
      "url": "",
      "stack": [
        { "src": "assets/go.png", "label": "Go" },
        { "src": "assets/rust.png", "label": "Rust" },
        { "src": "assets/python.png", "label": "Python" }
      ]
    },
    {
      "name": "GhostPIN",
      "accent": "#ff9f0a",
      "description": "is a page-bound MFA system that prevents phishing and fake checkouts during online payments.",
      "longTitle": "GhostPIN cryptographically binds payments to real merchant pages.",
      "details": "GhostPIN secures online payments by binding user authentication to the actual merchant page rather than just the session. It combines server-signed visual nonces with adaptive MFA so transactions cannot be replayed on phishing or injected checkout pages, acting as a missing trust layer for web commerce.",
      "url": "https://github.com/dannypeelen/ghostpin",
      "stack": [
        { "src": "assets/js.png", "label": "JavaScript" },
        { "src": "assets/ts.webp", "label": "TypeScript" },
        { "src": "assets/go.png", "label": "Go" }
      ]
    },
    {
      "name": "Flux",
      "accent": "#0a84ff",
      "description": "is a real-time decision engine that recommends the optimal credit card or payment method for each purchase.",
      "longTitle": "Flux optimizes payment decisions to maximize rewards and minimize lost value.",
      "details": "Flux evaluates purchase context against card rewards, caps, expirations, and offer rules to recommend the highest-value payment method in real time. It focuses on decision optimization rather than dashboards, helping users quantify value gained versus value left on the table.",
      "url": "",
      "stack": [
        { "src": "assets/kotlin.png", "label": "Kotlin" },
        { "src": "assets/ts.webp", "label": "TypeScript" },
        { "src": "assets/go.png", "label": "Go" }
      ]
    }
  ]
}
